app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
    @comments = Comment.where(post_id: @post.id)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]

  def create
    @post = Post.find(params[:post_id])
    @comment = Comment.new(comment_params)
    @comment.user = @current_user
    @comment.post = @post


    if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "yolo"], ["user_id", 6], ["post_id", 1], ["created_at", "2021-04-01 15:00:58.058612"], ["updated_at", "2021-04-01 15:00:58.058612"]]