app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def user_index
    @users = User.find(params[:user_id])

INSERT INTO "posts" ("title", "destination", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.user = @current_user

    if @post.save

UPDATE "posts" SET "destination" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["destination", "Colorado"], ["updated_at", "2021-04-04 00:26:38.376309"], ["id", 28]]
---
  def update
    if @post.update(post_params)